RT-Thread/rt-thread/bsp/lm3s/inc/hw_sysctl.h
//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC7 register.
//
//*****************************************************************************
#define SYSCTL_DC7_DMACH30      0x40000000  // SW.
#define SYSCTL_DC7_DMACH29      0x20000000  // I2S0_TX.
#define SYSCTL_DC7_DMACH28      0x10000000  // I2S0_RX.
#define SYSCTL_DC7_DMACH27      0x08000000  // ADC1_SS3.
#define SYSCTL_DC7_DMACH26      0x04000000  // ADC1_SS2.
#define SYSCTL_DC7_DMACH25      0x02000000  // SSI1_TX / ADC1_SS1.
#define SYSCTL_DC7_SSI1_TX      0x02000000  // SSI1 TX on uDMA Ch25.
#define SYSCTL_DC7_SSI1_RX      0x01000000  // SSI1 RX on uDMA Ch24.
#define SYSCTL_DC7_DMACH24      0x01000000  // SSI1_RX / ADC1_SS0.
#define SYSCTL_DC7_UART1_TX     0x00800000  // UART1 TX on uDMA Ch23.
#define SYSCTL_DC7_DMACH23      0x00800000  // UART1_TX.
#define SYSCTL_DC7_DMACH22      0x00400000  // UART1_RX.
#define SYSCTL_DC7_UART1_RX     0x00400000  // UART1 RX on uDMA Ch22.
#define SYSCTL_DC7_DMACH21      0x00200000  // Timer1B / EPI0_TX.
#define SYSCTL_DC7_DMACH20      0x00100000  // Timer1A / EPI0_RX.
#define SYSCTL_DC7_DMACH19      0x00080000  // Timer0B / Timer1B.
#define SYSCTL_DC7_DMACH18      0x00040000  // Timer0A / Timer1A.
#define SYSCTL_DC7_DMACH17      0x00020000  // ADC0_SS3.
#define SYSCTL_DC7_DMACH16      0x00010000  // ADC0_SS2.
#define SYSCTL_DC7_DMACH15      0x00008000  // ADC0_SS1 / Timer2B.
#define SYSCTL_DC7_DMACH14      0x00004000  // ADC0_SS0 / Timer2A.
#define SYSCTL_DC7_DMACH13      0x00002000  // UART2_TX.
#define SYSCTL_DC7_DMACH12      0x00001000  // UART2_RX.
#define SYSCTL_DC7_SSI0_TX      0x00000800  // SSI0 TX on uDMA Ch11.
#define SYSCTL_DC7_DMACH11      0x00000800  // SSI0_TX / UART1_TX.
#define SYSCTL_DC7_SSI0_RX      0x00000400  // SSI0 RX on uDMA Ch10.
#define SYSCTL_DC7_DMACH10      0x00000400  // SSI0_RX / UART1_RX.
#define SYSCTL_DC7_UART0_TX     0x00000200  // UART0 TX on uDMA Ch9.
#define SYSCTL_DC7_DMACH9       0x00000200  // UART0_TX / SSI1_TX.
#define SYSCTL_DC7_DMACH8       0x00000100  // UART0_RX / SSI1_RX.
#define SYSCTL_DC7_UART0_RX     0x00000100  // UART0 RX on uDMA Ch8.
#define SYSCTL_DC7_DMACH7       0x00000080  // ETH_TX / Timer2B.
#define SYSCTL_DC7_DMACH6       0x00000040  // ETH_RX / Timer2A.
#define SYSCTL_DC7_DMACH5       0x00000020  // USB_EP3_TX / Timer2B.
#define SYSCTL_DC7_USB_EP3_TX   0x00000020  // USB EP3 TX on uDMA Ch5.
#define SYSCTL_DC7_USB_EP3_RX   0x00000010  // USB EP3 RX on uDMA Ch4.
#define SYSCTL_DC7_DMACH4       0x00000010  // USB_EP3_RX / Timer2A.
#define SYSCTL_DC7_USB_EP2_TX   0x00000008  // USB EP2 TX on uDMA Ch3.
#define SYSCTL_DC7_DMACH3       0x00000008  // USB_EP2_TX / Timer3B.
#define SYSCTL_DC7_USB_EP2_RX   0x00000004  // USB EP2 RX on uDMA Ch2.
#define SYSCTL_DC7_DMACH2       0x00000004  // USB_EP2_RX / Timer3A.
#define SYSCTL_DC7_USB_EP1_TX   0x00000002  // USB EP1 TX on uDMA Ch1.
#define SYSCTL_DC7_DMACH1       0x00000002  // USB_EP1_TX / UART2_TX.
#define SYSCTL_DC7_DMACH0       0x00000001  // USB_EP1_RX / UART2_RX.
#define SYSCTL_DC7_USB_EP1_RX   0x00000001  // USB EP1 RX on uDMA Ch0.

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC8 register.
//
//*****************************************************************************
#define SYSCTL_DC8_ADC1AIN15    0x80000000  // ADC Module 1 AIN15 Pin Present.
#define SYSCTL_DC8_ADC1AIN14    0x40000000  // ADC Module 1 AIN14 Pin Present.
#define SYSCTL_DC8_ADC1AIN13    0x20000000  // ADC Module 1 AIN13 Pin Present.
#define SYSCTL_DC8_ADC1AIN12    0x10000000  // ADC Module 1 AIN12 Pin Present.
#define SYSCTL_DC8_ADC1AIN11    0x08000000  // ADC1 11 Pin Present.
#define SYSCTL_DC8_ADC1AIN10    0x04000000  // ADC1 10 Pin Present.
#define SYSCTL_DC8_ADC1AIN9     0x02000000  // ADC1 9 Pin Present.
#define SYSCTL_DC8_ADC1AIN8     0x01000000  // ADC1 8 Pin Present.
#define SYSCTL_DC8_ADC1AIN7     0x00800000  // ADC1 7 Pin Present.
#define SYSCTL_DC8_ADC1AIN6     0x00400000  // ADC1 6 Pin Present.
#define SYSCTL_DC8_ADC1AIN5     0x00200000  // ADC1 5 Pin Present.
#define SYSCTL_DC8_ADC1AIN4     0x00100000  // ADC1 4 Pin Present.
#define SYSCTL_DC8_ADC1AIN3     0x00080000  // ADC1 3 Pin Present.
#define SYSCTL_DC8_ADC1AIN2     0x00040000  // ADC1 2 Pin Present.
#define SYSCTL_DC8_ADC1AIN1     0x00020000  // ADC1 1 Pin Present.
#define SYSCTL_DC8_ADC1AIN0     0x00010000  // ADC1 0 Pin Present.
#define SYSCTL_DC8_ADC0AIN15    0x00008000  // ADC Module 0 AIN15 Pin Present.
#define SYSCTL_DC8_ADC0AIN14    0x00004000  // ADC Module 0 AIN14 Pin Present.
#define SYSCTL_DC8_ADC0AIN13    0x00002000  // ADC Module 0 AIN13 Pin Present.
#define SYSCTL_DC8_ADC0AIN12    0x00001000  // ADC Module 0 AIN12 Pin Present.
#define SYSCTL_DC8_ADC0AIN11    0x00000800  // ADC0 11 Pin Present.
#define SYSCTL_DC8_ADC0AIN10    0x00000400  // ADC0 10 Pin Present.
#define SYSCTL_DC8_ADC0AIN9     0x00000200  // ADC0 9 Pin Present.
#define SYSCTL_DC8_ADC0AIN8     0x00000100  // ADC0 8 Pin Present.
#define SYSCTL_DC8_ADC0AIN7     0x00000080  // ADC0 7 Pin Present.
#define SYSCTL_DC8_ADC0AIN6     0x00000040  // ADC0 6 Pin Present.
#define SYSCTL_DC8_ADC0AIN5     0x00000020  // ADC0 5 Pin Present.
#define SYSCTL_DC8_ADC0AIN4     0x00000010  // ADC0 4 Pin Present.
#define SYSCTL_DC8_ADC0AIN3     0x00000008  // ADC0 3 Pin Present.
#define SYSCTL_DC8_ADC0AIN2     0x00000004  // ADC0 2 Pin Present.
#define SYSCTL_DC8_ADC0AIN1     0x00000002  // ADC0 1 Pin Present.
#define SYSCTL_DC8_ADC0AIN0     0x00000001  // ADC0 0 Pin Present.

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCCAL
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCCAL_UTEN    0x80000000  // Use User Trim Value.
#define SYSCTL_PIOSCCAL_CAL     0x00000200  // Start Calibration.
#define SYSCTL_PIOSCCAL_UPDATE  0x00000100  // Update Trim.
#define SYSCTL_PIOSCCAL_UT_M    0x0000007F  // User Trim Value.
#define SYSCTL_PIOSCCAL_UT_S    0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_PIOSCSTAT
// register.
//
//*****************************************************************************
#define SYSCTL_PIOSCSTAT_DT_M   0x007F0000  // Default Trim Value.
#define SYSCTL_PIOSCSTAT_CR_M   0x00000300  // Calibration Result.
#define SYSCTL_PIOSCSTAT_CRNONE 0x00000000  // Calibration has not been
                                            // attempted.
#define SYSCTL_PIOSCSTAT_CRPASS 0x00000100  // The last calibration operation
                                            // completed to meet 1% accuracy.
#define SYSCTL_PIOSCSTAT_CRFAIL 0x00000200  // The last calibration operation
                                            // failed to meet 1% accuracy.
#define SYSCTL_PIOSCSTAT_CT_M   0x0000007F  // Calibration Trim Value.
#define SYSCTL_PIOSCSTAT_DT_S   16
#define SYSCTL_PIOSCSTAT_CT_S   0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_I2SMCLKCFG
// register.
//
//*****************************************************************************
#define SYSCTL_I2SMCLKCFG_RXEN  0x80000000  // RX Clock Enable.
#define SYSCTL_I2SMCLKCFG_RXI_M 0x0FF00000  // RX Clock Integer Input.
#define SYSCTL_I2SMCLKCFG_RXF_M 0x000F0000  // RX Clock Fractional Input.
#define SYSCTL_I2SMCLKCFG_TXEN  0x00008000  // TX Clock Enable.
#define SYSCTL_I2SMCLKCFG_TXI_M 0x00000FF0  // TX Clock Integer Input.
#define SYSCTL_I2SMCLKCFG_TXF_M 0x0000000F  // TX Clock Fractional Input.
#define SYSCTL_I2SMCLKCFG_RXI_S 20
#define SYSCTL_I2SMCLKCFG_RXF_S 16
#define SYSCTL_I2SMCLKCFG_TXI_S 4
#define SYSCTL_I2SMCLKCFG_TXF_S 0

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DC9 register.
//
//*****************************************************************************
#define SYSCTL_DC9_ADC1DC7      0x00800000  // ADC1 7 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC6      0x00400000  // ADC1 6 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC5      0x00200000  // ADC1 5 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC4      0x00100000  // ADC1 4 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC3      0x00080000  // ADC1 3 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC2      0x00040000  // ADC1 2 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC1      0x00020000  // ADC1 1 Dig Cmp Present.
#define SYSCTL_DC9_ADC1DC0      0x00010000  // ADC1 0 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC7      0x00000080  // ADC0 7 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC6      0x00000040  // ADC0 6 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC5      0x00000020  // ADC0 5 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC4      0x00000010  // ADC0 4 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC3      0x00000008  // ADC0 3 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC2      0x00000004  // ADC0 2 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC1      0x00000002  // ADC0 1 Dig Cmp Present.
#define SYSCTL_DC9_ADC0DC0      0x00000001  // ADC0 0 Dig Cmp Present.

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_NVMSTAT register.
//
//*****************************************************************************
#define SYSCTL_NVMSTAT_TPSW     0x00000010  // 1: Indicates 3rd party software
                                            // in ROM.
#define SYSCTL_NVMSTAT_FWB      0x00000001  // 32 Word flash write buffer
                                            // function available.

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_DSFLASHCFG
// register.
//
//*****************************************************************************
#define SYSCTL_DSFLASHCFG_SHDWN 0x00000001  // Flash Shutdown.

//*****************************************************************************
//
// The following are defines for the bit fields in the SYSCTL_GPIOHBCTL
// register.
//
//*****************************************************************************
#define SYSCTL_GPIOHBCTL_PORTJ  0x00000100  // Port J Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTH  0x00000080  // Port H Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTG  0x00000040  // Port G Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTF  0x00000020  // Port F Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTE  0x00000010  // Port E Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTD  0x00000008  // Port D Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTC  0x00000004  // Port C Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTB  0x00000002  // Port B Advanced Host Bus.
#define SYSCTL_GPIOHBCTL_PORTA  0x00000001  // Port A Advanced Host Bus.

//*****************************************************************************
//
// The following definitions are deprecated.
//
//*****************************************************************************
#ifndef DEPRECATED

//*****************************************************************************
//
// The following are deprecated defines for the system control register
// addresses.
//
//*****************************************************************************
#define SYSCTL_USER0            0x400FE1E0  // NV User Register 0
#define SYSCTL_USER1            0x400FE1E4  // NV User Register 1

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DID0
// register.
//
//*****************************************************************************
#define SYSCTL_DID0_VER_MASK    0x70000000  // DID0 version mask
#define SYSCTL_DID0_CLASS_MASK  0x00FF0000  // Device Class
#define SYSCTL_DID0_MAJ_MASK    0x0000FF00  // Major revision mask
#define SYSCTL_DID0_MAJ_A       0x00000000  // Major revision A
#define SYSCTL_DID0_MAJ_B       0x00000100  // Major revision B
#define SYSCTL_DID0_MAJ_C       0x00000200  // Major revision C
#define SYSCTL_DID0_MIN_MASK    0x000000FF  // Minor revision mask

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DID1
// register.
//
//*****************************************************************************
#define SYSCTL_DID1_VER_MASK    0xF0000000  // Register version mask
#define SYSCTL_DID1_FAM_MASK    0x0F000000  // Family mask
#define SYSCTL_DID1_FAM_S       0x00000000  // Stellaris family
#define SYSCTL_DID1_PRTNO_MASK  0x00FF0000  // Part number mask
#define SYSCTL_DID1_PINCNT_MASK 0x0000E000  // Pin count
#define SYSCTL_DID1_TEMP_MASK   0x000000E0  // Temperature range mask
#define SYSCTL_DID1_PKG_MASK    0x00000018  // Package mask
#define SYSCTL_DID1_QUAL_MASK   0x00000003  // Qualification status mask
#define SYSCTL_DID1_PRTNO_SHIFT 16

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DC0
// register.
//
//*****************************************************************************
#define SYSCTL_DC0_SRAMSZ_MASK  0xFFFF0000  // SRAM size mask
#define SYSCTL_DC0_FLASHSZ_MASK 0x0000FFFF  // Flash size mask

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DC1
// register.
//
//*****************************************************************************
#define SYSCTL_DC1_ADC          0x00010000  // ADC module present
#define SYSCTL_DC1_SYSDIV_MASK  0x0000F000  // Minimum system divider mask
#define SYSCTL_DC1_ADCSPD_MASK  0x00000F00  // ADC speed mask
#define SYSCTL_DC1_WDOG         0x00000008  // Watchdog present
#define SYSCTL_DC1_WDT          0x00000008  // Watchdog Timer Present.

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DC2
// register.
//
//*****************************************************************************
#define SYSCTL_DC2_I2C          0x00001000  // I2C present
#define SYSCTL_DC2_QEI          0x00000100  // QEI present
#define SYSCTL_DC2_SSI          0x00000010  // SSI present

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_DC3
// register.
//
//*****************************************************************************
#define SYSCTL_DC3_ADC7         0x00800000  // ADC7 pin present
#define SYSCTL_DC3_ADC6         0x00400000  // ADC6 pin present
#define SYSCTL_DC3_ADC5         0x00200000  // ADC5 pin present
#define SYSCTL_DC3_ADC4         0x00100000  // ADC4 pin present
#define SYSCTL_DC3_ADC3         0x00080000  // ADC3 pin present
#define SYSCTL_DC3_ADC2         0x00040000  // ADC2 pin present
#define SYSCTL_DC3_ADC1         0x00020000  // ADC1 pin present
#define SYSCTL_DC3_ADC0         0x00010000  // ADC0 pin present
#define SYSCTL_DC3_MC_FAULT0    0x00008000  // MC0 fault pin present

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// SYSCTL_PBORCTL register.
//
//*****************************************************************************
#define SYSCTL_PBORCTL_BOR_MASK 0x0000FFFC  // BOR wait timer
#define SYSCTL_PBORCTL_BOR_SH   2

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// SYSCTL_LDOPCTL register.
//
//*****************************************************************************
#define SYSCTL_LDOPCTL_MASK     0x0000003F  // Voltage adjust mask

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_SRCR0,
// SYSCTL_RCGC0, SYSCTL_SCGC0, and SYSCTL_DCGC0 registers.
//
//*****************************************************************************
#define SYSCTL_SET0_CAN2        0x04000000  // CAN 2 module
#define SYSCTL_SET0_CAN1        0x02000000  // CAN 1 module
#define SYSCTL_SET0_CAN0        0x01000000  // CAN 0 module
#define SYSCTL_SET0_PWM         0x00100000  // PWM module
#define SYSCTL_SET0_ADC         0x00010000  // ADC module
#define SYSCTL_SET0_ADCSPD_MASK 0x00000F00  // ADC speed mask
#define SYSCTL_SET0_ADCSPD_125K 0x00000000  // 125Ksps ADC
#define SYSCTL_SET0_ADCSPD_250K 0x00000100  // 250Ksps ADC
#define SYSCTL_SET0_ADCSPD_500K 0x00000200  // 500Ksps ADC
#define SYSCTL_SET0_ADCSPD_1M   0x00000300  // 1Msps ADC
#define SYSCTL_SET0_HIB         0x00000040  // Hibernation module
#define SYSCTL_SET0_WDOG        0x00000008  // Watchdog module

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_SRCR1,
// SYSCTL_RCGC1, SYSCTL_SCGC1, and SYSCTL_DCGC1 registers.
//
//*****************************************************************************
#define SYSCTL_SET1_COMP2       0x04000000  // Analog comparator module 2
#define SYSCTL_SET1_COMP1       0x02000000  // Analog comparator module 1
#define SYSCTL_SET1_COMP0       0x01000000  // Analog comparator module 0
#define SYSCTL_SET1_TIMER3      0x00080000  // Timer module 3
#define SYSCTL_SET1_TIMER2      0x00040000  // Timer module 2
#define SYSCTL_SET1_TIMER1      0x00020000  // Timer module 1
#define SYSCTL_SET1_TIMER0      0x00010000  // Timer module 0
#define SYSCTL_SET1_I2C1        0x00002000  // I2C module 1
#define SYSCTL_SET1_I2C0        0x00001000  // I2C module 0
#define SYSCTL_SET1_I2C         0x00001000  // I2C module
#define SYSCTL_SET1_QEI1        0x00000200  // QEI module 1
#define SYSCTL_SET1_QEI         0x00000100  // QEI module
#define SYSCTL_SET1_QEI0        0x00000100  // QEI module 0
#define SYSCTL_SET1_SSI1        0x00000020  // SSI module 1
#define SYSCTL_SET1_SSI0        0x00000010  // SSI module 0
#define SYSCTL_SET1_SSI         0x00000010  // SSI module
#define SYSCTL_SET1_UART2       0x00000004  // UART module 2
#define SYSCTL_SET1_UART1       0x00000002  // UART module 1
#define SYSCTL_SET1_UART0       0x00000001  // UART module 0

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_SRCR2,
// SYSCTL_RCGC2, SYSCTL_SCGC2, and SYSCTL_DCGC2 registers.
//
//*****************************************************************************
#define SYSCTL_SET2_ETH         0x50000000  // ETH module
#define SYSCTL_SET2_GPIOH       0x00000080  // GPIO H module
#define SYSCTL_SET2_GPIOG       0x00000040  // GPIO G module
#define SYSCTL_SET2_GPIOF       0x00000020  // GPIO F module
#define SYSCTL_SET2_GPIOE       0x00000010  // GPIO E module
#define SYSCTL_SET2_GPIOD       0x00000008  // GPIO D module
#define SYSCTL_SET2_GPIOC       0x00000004  // GPIO C module
#define SYSCTL_SET2_GPIOB       0x00000002  // GPIO B module
#define SYSCTL_SET2_GPIOA       0x00000001  // GIPO A module

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_RIS,
// SYSCTL_IMC, and SYSCTL_IMS registers.
//
//*****************************************************************************
#define SYSCTL_INT_PLL_LOCK     0x00000040  // PLL lock interrupt
#define SYSCTL_INT_CUR_LIMIT    0x00000020  // Current limit interrupt
#define SYSCTL_INT_IOSC_FAIL    0x00000010  // Internal oscillator failure int
#define SYSCTL_INT_MOSC_FAIL    0x00000008  // Main oscillator failure int
#define SYSCTL_INT_POR          0x00000004  // Power on reset interrupt
#define SYSCTL_INT_BOR          0x00000002  // Brown out interrupt
#define SYSCTL_INT_PLL_FAIL     0x00000001  // PLL failure interrupt

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_RESC
// register.
//
//*****************************************************************************
#define SYSCTL_RESC_WDOG        0x00000008  // Watchdog reset
#define SYSCTL_RESC_WDT         0x00000008  // Watchdog Timer Reset.

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_RCC
// register.
//
//*****************************************************************************
#define SYSCTL_RCC_SYSDIV_MASK  0x07800000  // System clock divider
#define SYSCTL_RCC_USE_SYSDIV   0x00400000  // Use sytem clock divider
#define SYSCTL_RCC_USE_PWMDIV   0x00100000  // Use PWM clock divider
#define SYSCTL_RCC_PWMDIV_MASK  0x000E0000  // PWM clock divider
#define SYSCTL_RCC_OE           0x00001000  // PLL output enable
#define SYSCTL_RCC_XTAL_3_68MHz 0x00000140  // Using a 3.6864 MHz crystal
#define SYSCTL_RCC_XTAL_4MHz    0x00000180  // Using a 4 MHz crystal
#define SYSCTL_RCC_XTAL_MASK    0x000003C0  // Crystal attached to main osc
#define SYSCTL_RCC_OSCSRC_MASK  0x00000030  // Oscillator input select
#define SYSCTL_RCC_SYSDIV_SHIFT 23          // Shift to the SYSDIV field
#define SYSCTL_RCC_PWMDIV_SHIFT 17          // Shift to the PWMDIV field
#define SYSCTL_RCC_XTAL_SHIFT   6           // Shift to the XTAL field
#define SYSCTL_RCC_OSCSRC_SHIFT 4           // Shift to the OSCSRC field

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_PLLCFG
// register.
//
//*****************************************************************************
#define SYSCTL_PLLCFG_OD_MASK   0x0000C000  // Output divider
#define SYSCTL_PLLCFG_F_MASK    0x00003FE0  // PLL multiplier
#define SYSCTL_PLLCFG_R_MASK    0x0000001F  // Input predivider
#define SYSCTL_PLLCFG_F_SHIFT   5
#define SYSCTL_PLLCFG_R_SHIFT   0

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the SYSCTL_RCC2
// register.
//
//*****************************************************************************
#define SYSCTL_RCC2_SYSDIV2_MSK 0x1F800000  // System clock divider
#define SYSCTL_RCC2_OSCSRC2_MSK 0x00000070  // Oscillator input select

//*****************************************************************************
//
// The following are deprecated defines for the bit fields in the
// SYSCTL_DSLPCLKCFG register.
//
//*****************************************************************************
#define SYSCTL_DSLPCLKCFG_D_MSK 0x1F800000  // Deep sleep system clock override
#define SYSCTL_DSLPCLKCFG_O_MSK 0x00000070  // Deep sleep oscillator override

